README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CEOS API Document</title>
<!-- 2017-11-10 Fri 11:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="fanwenjie" />
</head>
<body>
<div id="content">
<h1 class="title">CEOS API Document</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Overview</a></li>
<li><a href="#sec-2">2. 1 Conwin Embed Operaing System</a>
<ul>
<li><a href="#sec-2-1">2.1. 1.1 Task</a></li>
<li><a href="#sec-2-2">2.2. 1.2 Task_timer</a></li>
<li><a href="#sec-2-3">2.3. 1.3 Hard_timer</a></li>
<li><a href="#sec-2-4">2.4. 1.4 Queue</a></li>
<li><a href="#sec-2-5">2.5. 1.5 List</a></li>
<li><a href="#sec-2-6">2.6. 1.6 JSON lib</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 6.1 json parser</a></li>
<li><a href="#sec-2-6-2">2.6.2. 6.2 json object method</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 2 File System and Simple Database</a>
<ul>
<li><a href="#sec-3-1">3.1. 2.1 loop</a></li>
<li><a href="#sec-3-2">3.2. 2.2 File</a></li>
<li><a href="#sec-3-3">3.3. 2.3 Dir</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 3 Bus</a>
<ul>
<li><a href="#sec-4-1">4.1. 3.1 Bus master</a></li>
<li><a href="#sec-4-2">4.2. 3.2 Bus slave</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 4 Net</a>
<ul>
<li><a href="#sec-5-1">5.1. 4.1 Enthernet</a></li>
<li><a href="#sec-5-2">5.2. 4.2 GPRS &amp; 4G</a></li>
<li><a href="#sec-5-3">5.3. 4.3 DHCP Client</a></li>
<li><a href="#sec-5-4">5.4. 4.4 DNS Client</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 5 Http Server</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
conwin embed os采用分时调度方法，它的目标是简化应用程序的编写，增强程序的可读性和可维护性。
</p>
</blockquote>
<blockquote>
<p>
ceos的基本元素为Task，过去编写程序时，每个模块都有一个loop，再把所有的loop放到主程序的loop中，所有的loop依次执行。使用ceos框架，
每个模块只需要继承Task类，override loop方法即可，在loop中执行本模块的逻辑功能。
</p>
</blockquote>
<blockquote>
<p>
<b>使用ceos的一些约定</b>
</p>
<ul class="org-ul">
<li>数据类型请采用typedef.h中的定义
</li>
<li>代码中变量，函数的命名采用全小写加下划线方式，统一风格
</li>
<li>模块内的while循环无阻塞且尽可能的短
</li>
<li>模块和驱动程序之间采用函数直接调用的方式，但模块之间的操作尽量采用回调的方式以降低耦合度
</li>
</ul>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 1 Conwin Embed Operaing System</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 1.1 Task</h3>
<div class="outline-text-3" id="text-2-1">
<p>
系统基本对像，每一个需要loop的模块都应该继承Task类。
</p>
<ul class="org-ul">
<li>类定义 task.h
</li>
<li>提供方法:
</li>
</ul>
<blockquote>
<pre class="example">
i8 running();                       //判断Task是否运行
void pause();                       //挂起Task运行
void resume();                      //恢复Task运行
u16 pid();                          //获取task id
Task *parent();                     //获取Task的父类
const char *name();                 //获取Task名称
void push_timer(Task_timer *timer); //给Task增加timer(具体见1.2 Task_timer)
</pre>
</blockquote>
<ul class="org-ul">
<li>使用方法
</li>
<li>继承Task，构造方法必须指定父类和名称
</li>
<li>在setup方法中执行父类的setup方法，
</li>
<li>override loop方法
</li>
<li>使用示例
</li>
</ul>
<blockquote>
<div class="org-src-container">

<pre class="src src-c">//类定义
class Bus: public Task {
  private:
  public:
    Bus(Task *parent, const char *name);
    ~Bus();

    void setup();
    void loop();
}

//setup方法中执行父类的setup
i8 Bus::setup() {
  Task::setup();
}

//override loop
void Bus::loop() {

}

//类使用
bus = new Bus(&amp;panel_4008, "485-bus-master");
</pre>
</div>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 1.2 Task_timer</h3>
<div class="outline-text-3" id="text-2-2">
<p>
系统软件定时器，loop级别，非精准定时。
   t
</p>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 1.3 Hard_timer</h3>
<div class="outline-text-3" id="text-2-3">
<p>
系统硬件定时器，硬件中断级别，精准定时。
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 1.4 Queue</h3>
<div class="outline-text-3" id="text-2-4">
<p>
循环对像，提供以字节为单位的队列类型和以void *为单位的队列类型。
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 1.5 List</h3>
<div class="outline-text-3" id="text-2-5">
<p>
链表
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 1.6 JSON lib</h3>
<div class="outline-text-3" id="text-2-6">
<p>
JSON操作库，可以解析字符串为Json Ojbect，也可以创建Json Object，再序列化为字符串。
</p>
</div>

<div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> 6.1 json parser</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
字符串解析为Json Object
</p>
</div>
</div>

<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> 6.2 json object method</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Json对像操作方法，并序列化为字符串
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 2 File System and Simple Database</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 2.1 loop</h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 2.2 File</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 2.3 Dir</h3>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 3 Bus</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 3.1 Bus master</h3>
<div class="outline-text-3" id="text-4-1">
<p>
总线主设备驱动
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 3.2 Bus slave</h3>
<div class="outline-text-3" id="text-4-2">
<p>
总线从设备驱动
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 4 Net</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 4.1 Enthernet</h3>
<div class="outline-text-3" id="text-5-1">
<p>
W5500有线网络驱动
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 4.2 GPRS &amp; 4G</h3>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 4.3 DHCP Client</h3>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 4.4 DNS Client</h3>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 5 Http Server</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fanwenjie</p>
<p class="date">Created: 2017-11-10 Fri 11:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
